anthracnose_rec = """Антракноз — распространенное заболевание, к возбудителям которого причисляют грибки  Gloeosporium, Kabatiella и Colletotrichum групп фитопатогенных микомицетов. Чаще всего характерные симптомы появляются на растениях, иммунитет которых сильно ослаблен.
Грибок активно развивается при температуре +25-28 градусов, влажности воздуха – 95-100%. Риск возникновения недуга повышается из-за высокого уровня кислотности, резкого изменения температурного режима, недостатка минеральных веществ, в частности, фосфора и калия.
Индикатором служат светло-бурые пятна размером до 2 мм, которые позже становятся черными. Со временем пораженые участки сливаются в большие пятна, и лист гибнет. Порой на листовой пластинке, вдоль жилок, могут появиться сектора пораженной ткани (формой похожие на букву V).
<b>Рекомендации по уходу</b>
Лечение нужно начинать с внимательного осмотра растения. Заболевание атакует все надземные части растения. Со временем пятна сливаются и углубляются, образуя препятствия для движения питательных  веществ. Если не применять препараты от антракноза, больное растение погибнет."""
 
powdery_mildew_rec = """Мучнистая роса - инфекционная болезнь растений, вызывают грибоподобные организмы оомицеты из семейства пероноспоровых Peronosporaceae. признаком которой является появление на листьях, побегах и плодах белого паутинистого или мучнистого налёта, образованного мицелием и спороношениями возбудителем
На поверхности листьев поражённого растения возникает белый налёт мицелия, на котором после вызревания спор образуются капли жидкости — отсюда и название «мучнистая роса». Мицелий располагается пятнами чаще всего на листьях и молодых побегах, а также на черешках, плодоножках и плодах. Инфекция начинается обычно с расположенных ближе к земле листьев и постепенно распространяется на всё растение. Заражение плодов приводит к их растрескиванию и загниванию в результате вторичной инфекции.
Рекомендации по уходу
Лечить клубнику от мучнистой росы нужно обильно опрыскивая растения специальным раствором. Народные методы избавления от мучнистой росы имеют профилактическое, а не лечебное действие.
Самый действенный способ – профилактическая обработка розеток противогрибковыми средствами.
Сроки обработки:
• ранней весной в период формирования розетки;
• после сбора урожая;
• через 2 недели после второй обработки."""
 
grew_mold_rec = """Серая гниль – болезнь, вызванная склеротиниевыми грибами рода Botryotinia.
Споры способны стремительно распространяться на больших площадях. С помощью ветра разносятся по соседним участкам. Теряется до 60 % ягод.
Симптомы:
• листья, завязи, ягоды покрываются бурыми пятнами;
• на ягодах появляется серый налёт;
• на поздней стадии инфицированные поверхности покрываются склеротиями.
Рекомендации по уходу
Причиной появления серой гнили могут быть остатки прошлогодней мульчи, сорняков или гниющей соломы, а также чрезмерно густые заросли клубники на грядках.
Лечение серой гнили возможно, но требует химических препаратов. Профилактика мучнистой росы включает соблюдение нормы поливов, прореживание посадок, удаление сорняков.
Чтобы избежать появления серой гнили, нужно:
• соблюдать технологию посадки клубники
• тщательно пропалывать грядки
• использовать в качестве мульчи слой соломы или торфа толщиной 3-5 см
• до образования завязи обрабатывать грунт известью или золой
• чередовать клубничные грядки с грядками петрушки, чеснока и лука
• до начала цветения обрабатывать кусты клубники растворами фунгицидов
• не давать спелым ягодам касаться мокрой земли
• разрыхлять почву после каждого дождя"""
 
angular_leafspot_rec = """Грибок Marssonina petontillae относящийся к классу несовершенных грибов считается самым распространенным недугом на посадках клубники. Урон серьезный, теряется до 70-80% листьев растений, при этом инфекция успешно маскируется в небольшой период ремиссии.
Пик приходится на июль и август, а заражение происходит в весенние месяцы.
Из-за поражения листовых пластин нарушаются процессы фотосинтеза, замедляется развитие, рост культуры, отмирают инфицированные ткани. Пораженная грибком рассада выглядит слабой, на взрослых растениях заметен дефект карликовости.
Рекомендации по уходу
При обнаружении болезни на кустах, лучше сразу уничтожить, сжечь. Но остальные необходимо обработать, чтобы сдержать распространение инфекции. Даже если они на вид кажутся здоровыми, споры грибков уже могли на них перелететь.
Наиболее эффективной защитой земляничных грядок от большинства заболеваний и вредителей являются меры профилактики, включающие в себя соблюдение агротехники и своевременные опрыскивания. Если не позаботиться о защите ягодных плантаций, есть риск потерять урожай полностью.
Общие меры профилактики болезней и вредителей:
• Своевременная прополка и уничтожение сорной растительности. Уборка растительных остатков в конце сезона и обрезка листьев осенью. На сорняках и старых листьях могут находиться насекомые, споры грибков, бактерии.
• Соблюдение севооборота. Смена участка каждые три года. Запрет на высаживание после неблагоприятных предшественников – картофеля, томатов, тыквы.
• Покупка посадочного материала у проверенных поставщиков. Часто недобросовестные продавцы отдают уже заражённую чем-либо землянику.
• Соблюдение нормы и частоты полива, своевременное внесение подкормок – золы, раствора коровяка, комплексных минеральных удобрений."""
 
disease_recommendations = {
    "anthracnose_fruit_rot" : anthracnose_rec,
    "leaf_spot" : "", 
    "blossom_blight" : "",
    "gray_mold" : grew_mold_rec,
    "angular_leafspot" : angular_leafspot_rec,
    "powdery_mildew_fruit" : powdery_mildew_rec,
    "powdery_mildew_leaf" : powdery_mildew_rec,
}